In [1]:
import pandas as pd

inplace=True apply changes to dataframe

In [2]:
person = {
    'first': "Asghar",
    'last' : "abbasi",
    'email': "abc@gmail.com"
}

In [3]:
people = {
    'first': ['Azhar'],
    'last' : ["Ali"],
    'email': ['Azhar@gmail.com']
}

In [4]:
people = {
    'first': ['Azhar', 'Ali', 'sahito','Humza'],
    'last' : ["Ali", "Sahito", "Azhar","Abbasi"],
    'email': ['Azhar@gmail.com', 'ali@gmail.com', 'sahito@gmail.com', 'hamza@gmail.com']
}

In [5]:
df = pd.DataFrame(people)
df

    first    last             email
0   Azhar     Ali   Azhar@gmail.com
1     Ali  Sahito     ali@gmail.com
2  sahito   Azhar  sahito@gmail.com
3   Humza  Abbasi   hamza@gmail.com

In [6]:
df['email'] # preferred

0     Azhar@gmail.com
1       ali@gmail.com
2    sahito@gmail.com
3     hamza@gmail.com
Name: email, dtype: object

In [7]:
df.email

0     Azhar@gmail.com
1       ali@gmail.com
2    sahito@gmail.com
3     hamza@gmail.com
Name: email, dtype: object

In [8]:
df[['first','last']] # accessing multiple columns

    first    last
0   Azhar     Ali
1     Ali  Sahito
2  sahito   Azhar
3   Humza  Abbasi

In [9]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [10]:
df.iloc[2]  # index location

first              sahito
last                Azhar
email    sahito@gmail.com
Name: 2, dtype: object

In [11]:
df.iloc[[0,1]]  # index location

   first    last            email
0  Azhar     Ali  Azhar@gmail.com
1    Ali  Sahito    ali@gmail.com

In [12]:
df.iloc[[0,1],2]  # index location with specified column

0    Azhar@gmail.com
1      ali@gmail.com
Name: email, dtype: object

In [13]:
df.loc[[0,1]]

   first    last            email
0  Azhar     Ali  Azhar@gmail.com
1    Ali  Sahito    ali@gmail.com

In [14]:
df.loc[[0,1],'last']

0       Ali
1    Sahito
Name: last, dtype: object

In [15]:
# df.set_index('email', inplace=True)

In [16]:
# df

In [17]:
# df.loc['Azhar@gmail.com']

# Filtering Data

In [18]:
filt = (df['last'] == 'Ali')

In [19]:
df[filt]
df.loc[filt] #both wrok same but in loc we can pass column name like df.loc[filt,'last']

   first last            email
0  Azhar  Ali  Azhar@gmail.com

# Updating Rows and Columns

In [20]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [21]:
df.columns = ['first name','last name','User_email'] # Changing columns name method 1
df.columns

Index(['first name', 'last name', 'User_email'], dtype='object')

In [22]:
df.columns = [x.upper() for x in df.columns] # upper case columns names
df.columns

Index(['FIRST NAME', 'LAST NAME', 'USER_EMAIL'], dtype='object')

In [23]:
df.columns = df.columns.str.replace(' ','_')
df.columns

Index(['FIRST_NAME', 'LAST_NAME', 'USER_EMAIL'], dtype='object')

In [24]:
df.rename(columns={'FIRST_NAME':'first', 'LAST_NAME':"last"}, inplace=True) # Changing columns name method 2
df.rename(columns={'USER_EMAIL':'email'}, inplace=True)
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [25]:
df.loc[2] = ['Zohaib', 'chandio', 'ZOHAIB12@gmail.com'] # changing Row data 
print(df.loc[2])
df

first                Zohaib
last                chandio
email    ZOHAIB12@gmail.com
Name: 2, dtype: object

    first     last               email
0   Azhar      Ali     Azhar@gmail.com
1     Ali   Sahito       ali@gmail.com
2  Zohaib  chandio  ZOHAIB12@gmail.com
3   Humza   Abbasi     hamza@gmail.com

In [26]:
df.loc[1,['first','email']] = ['Raza', 'raza1@gmail.com']
df

    first     last               email
0   Azhar      Ali     Azhar@gmail.com
1    Raza   Sahito     raza1@gmail.com
2  Zohaib  chandio  ZOHAIB12@gmail.com
3   Humza   Abbasi     hamza@gmail.com

In [27]:
df.loc[0,'last'] ='Sahito' #change single value method 1
# df.at[0,'last'] = "ALI"    #method 2
df

    first     last               email
0   Azhar   Sahito     Azhar@gmail.com
1    Raza   Sahito     raza1@gmail.com
2  Zohaib  chandio  ZOHAIB12@gmail.com
3   Humza   Abbasi     hamza@gmail.com

In [28]:
df['email'] = df['email'].str.lower() #Changing into lower case all emails both methods work same
df['email'].str.lower()
df

    first     last               email
0   Azhar   Sahito     azhar@gmail.com
1    Raza   Sahito     raza1@gmail.com
2  Zohaib  chandio  zohaib12@gmail.com
3   Humza   Abbasi     hamza@gmail.com

In [29]:
df['email'].apply(len) # gives length of emails

0    15
1    15
2    18
3    15
Name: email, dtype: int64

In [30]:
def update_email(email):
    return email.upper()
df['email'].apply(update_email)
df

    first     last               email
0   Azhar   Sahito     azhar@gmail.com
1    Raza   Sahito     raza1@gmail.com
2  Zohaib  chandio  zohaib12@gmail.com
3   Humza   Abbasi     hamza@gmail.com

In [31]:
df['email'] = df['email'].apply(lambda x: x.lower()) 
df

    first     last               email
0   Azhar   Sahito     azhar@gmail.com
1    Raza   Sahito     raza1@gmail.com
2  Zohaib  chandio  zohaib12@gmail.com
3   Humza   Abbasi     hamza@gmail.com

In [32]:
df.apply(len) # gives values in row

first    4
last     4
email    4
dtype: int64

In [33]:
df.apply(pd.Series.min) # finding minimum value both method work same
# df.apply(lambda x : x.min())

first              Azhar
last              Abbasi
email    azhar@gmail.com
dtype: object

In [34]:
df.applymap(len)

   first  last  email
0      5     6     15
1      4     6     15
2      6     7     18
3      5     6     15

In [35]:
df.applymap(str.upper) # this just retrun copy of upper case values 
df = df.applymap(str.upper) #this replace dataframe with upper case values
df

    first     last               email
0   AZHAR   SAHITO     AZHAR@GMAIL.COM
1    RAZA   SAHITO     RAZA1@GMAIL.COM
2  ZOHAIB  CHANDIO  ZOHAIB12@GMAIL.COM
3   HUMZA   ABBASI     HAMZA@GMAIL.COM

In [36]:
df['email'] = df['email'].replace({'RAZA1@GMAIL.COM':'razaChandio@gmail.com'})
df

    first     last                  email
0   AZHAR   SAHITO        AZHAR@GMAIL.COM
1    RAZA   SAHITO  razaChandio@gmail.com
2  ZOHAIB  CHANDIO     ZOHAIB12@GMAIL.COM
3   HUMZA   ABBASI        HAMZA@GMAIL.COM

# Adding and removing columns

In [37]:
df['first'] + '_' + df['last'] #combining columns

0      AZHAR_SAHITO
1       RAZA_SAHITO
2    ZOHAIB_CHANDIO
3      HUMZA_ABBASI
dtype: object

In [38]:
df['full_name'] = df['first'] + '_' + df['last']  #combining columns and creating new one
df

    first     last                  email       full_name
0   AZHAR   SAHITO        AZHAR@GMAIL.COM    AZHAR_SAHITO
1    RAZA   SAHITO  razaChandio@gmail.com     RAZA_SAHITO
2  ZOHAIB  CHANDIO     ZOHAIB12@GMAIL.COM  ZOHAIB_CHANDIO
3   HUMZA   ABBASI        HAMZA@GMAIL.COM    HUMZA_ABBASI

In [39]:
df.drop(columns=['last','first']) # removing columns

                   email       full_name
0        AZHAR@GMAIL.COM    AZHAR_SAHITO
1  razaChandio@gmail.com     RAZA_SAHITO
2     ZOHAIB12@GMAIL.COM  ZOHAIB_CHANDIO
3        HAMZA@GMAIL.COM    HUMZA_ABBASI